* Generate my files listing

#+begin_src python :results html :exports both
import os
import urllib.parse

l = []
url = 'https://github.com/baileywickham/files/raw/master/'
for file in os.listdir('.'):
    u = url + urllib.parse.quote(file)
    l.append(f'<a href={u}>{u}</a><br>')

return '\n'.join(l)
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
<a href=https://github.com/baileywickham/files/raw/master/Online%20Return%20Center.pdf>https://github.com/baileywickham/files/raw/master/Online%20Return%20Center.pdf</a><br>
<a href=https://github.com/baileywickham/files/raw/master/.git>https://github.com/baileywickham/files/raw/master/.git</a><br>
<a href=https://github.com/baileywickham/files/raw/master/index.org>https://github.com/baileywickham/files/raw/master/index.org</a><br>
<a href=https://github.com/baileywickham/files/raw/master/.%23index.org>https://github.com/baileywickham/files/raw/master/.%23index.org</a><br>
<a href=https://github.com/baileywickham/files/raw/master/CNAME>https://github.com/baileywickham/files/raw/master/CNAME</a><br>
<a href=https://github.com/baileywickham/files/raw/master/index.html>https://github.com/baileywickham/files/raw/master/index.html</a><br>
#+END_EXPORT


#+begin_src bash :export both
filename="" 

git filter-branch --force --index-filter \
  "git rm --cached --ignore-unmatch ${filename}" \
  --prune-empty --tag-name-filter cat -- --all
#+end_src

#+RESULTS:
